// Напишите программу, которая перевернёт одномерный массив
// (последний элемент будет на первом месте, а первый - на последнем и т.д.)

// раб метод преобразующий
/*
void ReverseArray(int[] array)
{
    for(int left = 0, right = array.Length -1; left < right; left++, right--)
    {
        int temp = array[left];
        array[left] = array[right];
        array[right] = temp;
    }
}

int[] myArray = {1, 2, 3, 4, 5};

ReverseArray(myArray);

for(int i = 0; i < myArray.Length; i++)
   Console.Write(myArray[i] + " ");
*/

// Напишите программу, которая принимает на вход три числа и проверяет,
// может ли существовать треугольник с сторонами такой длины.

//Не используя рекурсию, выведите первые
// N чисел Фибоначчи. Первые два числа Фибоначчи: 0 и 1.

//Напишите программу, которая будет 
// создавать копию заданного массива с помощью поэлементного копирования. 
// Аналитически-генерирующий метод.

// Напишите программу, 
//которая будет преобразовывать десятичное число в двоичное. 
// исходное число типа инт в стринг строка. 

// mathprofi - изучить ресурс

// Задайте двумерный массив размера m на n,
// каждый элемент в массиве находится по формуле: Aij = i+j. Выведите полученный массив на экран. Генерирующий метод.

// Задайте двумерный массив. Найдите элементы, 
// у которых оба индекса чётные, и замените эти элементы на их квадраты.


// Задайте двумерный массив. Найдите сумму элементов, 
//находящихся на главной диагонали (с индексами (0,0); (1;1) и т.д.

//по домашке: задача 2 войд, что число есть. задача 3 - из двумерного в одномерный массив